# ErrorMessage Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarUpdateCurvesData..::..ErrorMessage Property
RebarUpdateCurvesData Class See Also
---
The reason for calculation failure. If the calculation fails, this message will be shown in an error, or warning if we are editing the constraints.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018.1
# Syntax
C#
---
```text
public string ErrorMessage { get; set; }
```

Visual Basic
---
```text
Public Property ErrorMessage As String
	Get
	Set
```

Visual C++
---
```text
public:
property String^ ErrorMessage {
	String^ get ();
	void set (String^ value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | When setting this property: errorMessage is an empty string. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also
RebarUpdateCurvesData Class
Autodesk.Revit.DB.Structure Namespace